* - includes all columns in the table
; - put at end of statment
!= - not equal to
<> - not equal to
NULL - evaluates to false but null cannot be compared to null
BETWEEN - between
DESC or ASC - descending or ascending
DISTINCT - no repeats
LIMIT 10 - limits to 10
FETCH FIRST 10 ROWS ONLY - first 10 rows
UPPER - uppercase
LOWER - lowercase
LENGTH - length
TRIM - gets rid of outside spaces
MAX - gives maxiumum
MIN
AVG
ROUND
COUNT

select substring of the data starting from 1 and for 4 characters

SELECT SUBSTRING('This is test data' FROM 1 FOR 4) test_data_extracted;

replace name in a column with another name

SELECT department, REPLACE(department, 'Clothing', 'Attire') modified_data;

create a new column with full name, space, rename column
SELECT department,
department || 'department' AS complete_name
FROM departments

add something in column, email is where to add, none is what to add, name is column name

SELECT COALESCE(email, 'none;) as name

results in table with email domain name taken out (without @), and null emails taken out and order count descending
OR if want to select certain value, use: LIKE '%furn%' or LIKE 'F%urn%'

SELECT substring(email, position('@' IN email)+1) 
	AS email_domain, count(*)
FROM employees
WHERE email IS NOT NULL
GROUP BY substring(email, position('@' IN email)+1)
ORDER BY COUNT(*) DESC;

results in a table that finds min, max and avg salary for gender and region, 
and round avg salary and sorts ascending both gender and region_id

SELECT gender, region_id, MIN(salary) min_salary, MAX(salary) max_salary, round(AVG(salary)) avg_salary
FROM employees
GROUP BY gender, region_id
ORDER BY gender, region_id;

finds the largest value in a table but lists a different column than what the largest value is in

SELECT state
FROM fruit_imports 
GROUP BY state
ORDER BY SUM(supply) desc
LIMIT 1;

returns the state that has more than 1 import of the same fruit

SELECT state
FROM fruit_imports
GROUP BY state, name
HAVING COUNT(name) > 1;

returns the seasons that produce either 3 fruits or 4 fruits

SELECT season, COUNT(name)
FROM fruit_imports
GROUP BY season
HAVING count(name) = 3 OR count(name) = 4;

takes into consideration the  supply and cost_per_unit columns for determining the total cost and returns the most expensive state with the total cost

SELECT state, SUM(supply*cost_per_unit) total_cost
FROM fruit_imports
GROUP BY state
ORDER BY total_cost desc
LIMIT 1;

counts the number of columns and includes null values

SELECT COUNT(COALESCE(fruit_name, 'SOMEVALUE'))
FROM fruits;

reorganize columns and this gives all the columns with first_name first

SELECT first_name, * FROM employees;

select from department table using aliases or can use entire table name

SELECT d.department
FROM employees e, departments d;

returns all of the departments that exist in employees table and not in departments table

SELECT * FROM employees
WHERE department NOT IN (SELECT department FROM departments);

use a query to specify where data is from rather than a table but must give name like query1

SELECT *
FROM (SELECT * FROM employees WHERE salary > 150000) query1;

if assign names in the query (what is in brackets) then must use that name in the select statement; also shows can have multiple sources and reference which subquery (b in this case); always reference aliases

SELECT b.employee_name, a.yearly_salary
FROM (SELECT first_name employee_name, salary yearly_salary
	FROM employees WHERE salary > 150000) a
	(SELECT department employee_name FROM departments) b;

subquery in FROM clause

SELECT *
FROM (SELECT department FROM departments) a;

subquery in SELECT clause, need to use the 1 to limit to 1 name, 

SELECT first_name, last_name, salary, (SELECT first_name FROM employees limit 1)
FROM employees;

selects all employees from one take where they are in a certain department as determined from another table (departments)

SELECT * FROM employees
WHERE department 
	IN (SELECT department FROM departments WHERE division = 'Electronics');

refers to 2 tables and shows where salary over 130000 and work in certain country

SELECT * FROM employees
WHERE salary > 130000
AND region_id IN (SELECT region_id FROM regions WHERE country = 'Canada' OR country = 'Asia');

shows first name, department and difference of employees salary from max salary

SELECT first_name, department, (SELECT MAX(salary) FROM employees) - salary 
FROM employees
WHERE region_id IN (SELECT region_id FROM regions
				   WHERE country IN ('Asia', 'Canada'));

need to use ANY or ALL when have multiple results from subquery

SELECT * FROM employees
WHERE region_id > ALL (SELECT region_id FROM regions WHERE country = 'United States');

query that returns all of the employees who work in the kids division AND the dates at which those employees where hired is greater than all of the hire dates of employees who work in the manintenance department

SELECT * FROM employees
WHERE department = ANY (SELECT department 
			        FROM departments 
			         WHERE division = 'Kids')
AND hire_date > ALL (SELECT hire_date
		             FROM employees 
		              WHERE department = 'Maintenance');

select only 1 name with one of numbers where multiple names

SELECT min(id), name
FROM dupes
GROUP BY name;

delete duplicate records

DELETE FROM dupes
WHERE id NOT IN (
SELECT min(id)
FROM dupes
GROUP BY name
);

compute ave salary but remove max and min salary

SELECT ROUND(AVG(salary))
FROM employees
WHERE salary NOT IN (
(SELECT MIN(salary) FROM employees),
(SELECT MAX(salary) FROM employees)
);